#include <iostream>
#include <string>
#include <clocale>

using namespace std;

int task1(int s) {
	cout << "Задача №1" << endl;
	int A, B;
	cout << "Введите номер дня (1-31): ";
	cin >> A;
	cout << "Введите номер месяца(1-12): ";
	cin >> B;
	string day1[31] = { "Первое", "Второе", "Третье", "Четвертое", "Пятое", "Шестое", "Седьмое", "Восьмое", "Девятое", "Десятое", "Одинадцатое", "Двенадцатое", "Тринадцатое",
		"Четырнадцатое", "Пятнадцатое", "Шестнадцатое", "Семнадцатое", "Восемнадцатое", "Девятнадцатое", "Двадцатое", "Двадцать первое", "Двадцать второе", "Двадцать третье", 
		"Двадцать четвертое", "Двадцать пятое", "Двадцать шестое", "Двадцать седьмое", "Двадцать восьмое", "Двадцать девятое", "Тридцатое" , "Тридцать первое"};
	string month[12] = { "января", "февраля", "марта", "апреля", "мая", "июня", "июля", "августа",
	"сентября", "октября", "ноября", "декабря" };
	cout << day1[A-1] + " " + month[B - 1] << endl;
	return 0;
}


int task2(int s) {
	cout << "Задача №2" << endl;
	int N, nap1;
	char C;
	string nap[4] = { "Север","Запад","Юг","Восток" };
	cout << "Выберите направление (N - север, W - запад, S - юг, E - восток): ";
	cin >> C;
	cout << "Введите команду (0 — продолжать движение, 1 — поворот налево, -1 — поворот направо): ";
	cin >> N;
	if ((int)C == 78 || (int)C == 110 || (int)C == 145 || (int)C == 225)
	{
		nap1 = 0;
	}
	else if ((int)C == 69 || (int)C == 101 || (int)C == 130 || (int)C == 162)
	{
		nap1 = 1;
	}
	else if ((int)C == 83 || (int)C == 115 || (int)C == 158 || (int)C == 238)
	{
		nap1 = 2;
	}
	else if ((int)C == 87 || (int)C == 119 || (int)C == 135 || (int)C == 167)
	{
		nap1 = 3;
	}
	nap1 = (nap1 + N) % 4;
	cout << nap[nap1] << endl;
	return 0;
}


int task3(int s) {
	cout << "Задача №3" << endl;
	string mas1[31] = { "Десять","Одиннадцать","Двенадцать","Тринадцать","Четырнадцать","Пятнадцать","Шестнадцать","Семнадцать","Восемнадцать","Девятнадцать","Двадцать","Двадцать одно",
		"Двадцать два","Двадцать три","Двадцать четыре","Двадцать пять","Двадцать шесть","Двадцать семь","Двадцать восемь","Двадцаать девять","Тридцать","Тридцать одно","Тридцать два",
		"Тридцать три","Тридцать четыре","Тридцать пять","Тридцать шесть","Тридцать семь","Тридцать восемь","Тридцать девять","Сорок" };
	int n;
	cout << "Введите кол-во заданий (10-40): ";
	cin >> n;
	if (n < 21 or (n >= 25 and n <= 30) or (n >= 35 and n <= 40)) {
		cout << mas1[n - 10] + " учебных заданий\n";
	}else if (n == 21 or n == 31) {
		cout << mas1[n - 10] + " учебное задание\n";
	}else {
		cout << mas1[n - 10] + " учебных задания\n";
	}
	return 0;
}


int task4(int s) {
	cout << "Задача №4" << endl;
	int n, n1, n2, n3, spn;
	cout << "Введите число (100-999): ";
	cin >> n;
	string sotki[9] = { "Сто","Двести","Триста","Четыреста","Пятьсот","Шестьсот","Семьсот", "Восемьсот","Девятьсот" },
		des[9] = { "десять","двадцать","тридцать","сорок","пятьдесят","шестьдесят","семьдесят","восемьдесят","девяносто" },
		ed[9] = { "один","два","три","четыре","пять","шесть","семь","восемь","девять" },
		sp[9] = { "одиннадцать","двенадцать","тринадцать","четырнадцать","пятнадцать","шестнадцать","семнадцать","восемнадцать","девятнадцать" };
	n1 = n / 100;
	n2 = (n / 10) % 10;
	n3 = n % 10;
	spn = n % 100;
	if (n2 == 0 && n3 == 0) {
		cout << sotki[n1 - 1] << endl;
	}else if (n2 != 0 && n3 == 0) {
		cout << sotki[n1 - 1] + " " + des[n2-1]<< endl;
	}else if (n2 == 0 && n3 != 0) {
		cout << sotki[n1 - 1] + " " + ed[n3 - 1] << endl;
	}else if (spn > 10 && spn < 20) {
		cout << sotki[n1 - 1] + " " + sp[spn - 11] << endl;
	}else {
		cout << sotki[n1 - 1] + " " + des[n2 - 1] + " " + ed[n3 - 1] << endl;
	}
	return 0;
}


int task5(int s) {
	cout << "Задача №5" << endl;
	int n;
	cout << "Введите год: ";
	cin >> n;
	string color[5] = { "зелен","красн","желт","бел","черн" },
		animal[12] = { "ой крысы", "ой коровы", "ого тигра", "ого зайца", "ого дракона", "ой змеи", "ой лошади", "ой овцы", "ой обезьяны", "ой курицы", "ой собаки", "ой свиньи" };
	n = abs(n - 1984) % 60;
	cout << "Год " + color[n / 12] + animal[n % 12] << endl;
	return 0;
}


int main() {
	setlocale(LC_ALL, "");
	int n;
	T1:
	cout << "Выберете задачу (1-5):" << endl;
	cout << "Для выхода из программы введите '0'" << endl;
	cin >> n;
	if (n == 1) {
		task1(1);
	}
	else if (n == 2) {
		task2(1);
	}
	else if (n == 3) {
		task3(1);
	}
	else if (n == 4) {
		task4(1);
	}
	else if (n == 5) {
		task5(1);
	}
	else if (n != 0) {
		cout << "Такой задачи нет\n";
	}
	else if (n == 0) {
		return 0;
	}
	goto T1;
}
