// lab4terekhov.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>

int main()
{
    using namespace std;
    // 1
    std::cout << "1. Pust' storony ravny:\n";
    int a = 2;
    int b = 3;
    cout << "a = " << a << endl;
    cout << "b = " << b << endl;
    std::cout << "Togda:\n";
    int S = a * b;
    int P = 2 * (a + b);
    cout << "S = " << S << endl;
    cout << "P = " << P << endl << endl;
    
    // 2
    std::cout << "2. Pust' diametr d raven ";
    float d = 4;
    float p = 3.14;
    float L = p * d;
    cout << d << endl;
    std::cout << "Togda eyo dlina L ravna " << L << endl << endl;

    //3
    int a = 2;
    int b = 3;
    std::cout << "3. Pust' a i b ravny" << a << "i" << b << "sootvetstvenno";



    
    
    
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
